app/Controllers/Admin.php

SELECT *
FROM `gender`
---
    public function data_santri()
    {
        $data['title'] = 'Data Santri';

        // builder for data santri
        $this->builder->select('users.id as userid, username, fullname, email, user_image, jk, no_telp, wali, no_wali, thn_masuk, kamar');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');

        // $this->builder->join('kamar_santri', 'kamar_santri.gender_id = users.jk');
        // $this->santri->select('nama_kamar')->where('id_kamar', )

        $this->builder->where('auth_groups.id', array('id' => 2));
        $query = $this->builder->get();
        $data['users'] = $query->getResult();

        // builder for tambah santri
        $query = $this->gender->get();

SELECT *
FROM `kamar_santri`
WHERE `gender_id` = '1'
---
    public function getKamar($id_kamar = null)
    {
        $kamar_santri = $this->db->table('kamar_santri')->where('gender_id', $id_kamar)->get()->getResult();